{
  "navigation": {
    "home": "Trang chủ",
    "techniques": "Kỹ thuật",
    "dojos": "Võ đường",
    "digitalLibrary": "Thư viện số"
  },
  "home": {
    "philosophy": "Triết lý",
    "principleOf": "Nguyên lý",
    "riai": "Riai",
    "riaiDescription1": "Riai đại diện cho nguyên lý cơ bản thống nhất tất cả các khía cạnh của việc luyện tập Aikido. Nó dạy rằng các chuyển động của cơ thể, kiếm và gậy đều chia sẻ những nguyên lý thiết yếu giống nhau.",
    "riaiDescription2": "Trong phong cách Iwama, được O-Sensei Morihei Ueshiba phát triển trong những năm tháng sống tại thị trấn Iwama, sự tích hợp này là tối quan trọng. Việc luyện tập với vũ khí làm sáng tỏ các nguyên lý của kỹ thuật tay không.",
    "taijutsu": "Taijutsu",
    "bodyArts": "Thuật cơ thể",
    "ken": "Ken",
    "sword": "Kiếm",
    "jo": "Jo",
    "staff": "Gậy",
    "featuredTechniques": "Kỹ thuật nổi bật",
    "exploreFoundational": "Khám phá các kỹ thuật nền tảng của Iwama Aikido",
    "viewAllTechniques": "Xem tất cả kỹ thuật",
    "view": "Xem",
    "globalDojoNetwork": "Mạng lưới võ đường toàn cầu",
    "connectWithDojos": "Kết nối với các võ đường Iwama Aikido chính thống trên toàn thế giới",
    "exploreAllDojos": "Khám phá tất cả võ đường",
    "quote": "Aikido không phải là kỹ thuật để chiến đấu hay đánh bại kẻ thù. Đó là con đường để hòa giải thế giới và làm cho loài người trở thành một gia đình.",
    "oSensei": "Morihei Ueshiba, O-Sensei",
    "welcomeTo": "Chào mừng đến với",
    "iwamaAikido": "Iwama Aikido",
    "continueScrolling": "Tiếp tục cuộn",
    "scrollToEnter": "Cuộn để vào"
  },
  "techniques": {
    "title": "Thư viện kỹ thuật",
    "description": "Khám phá các kỹ thuật truyền thống của phong cách Iwama Aikido, bao gồm kỹ thuật tay không (Taijutsu), kiếm thuật (Aiki-Ken) và gậy thuật (Aiki-Jo).",
    "allTechniques": "Tất cả kỹ thuật",
    "allLevels": "Tất cả cấp độ",
    "showing": "Hiển thị {count} kỹ thuật",
    "showingPlural": "Hiển thị {count} kỹ thuật",
    "postures": "{count} tư thế",
    "notes": "{count} ghi chú",
    "study": "Học",
    "noTechniquesFound": "Không tìm thấy kỹ thuật",
    "adjustFilters": "Hãy thử điều chỉnh bộ lọc để xem thêm kết quả.",
    "clearFilters": "Xóa bộ lọc",
    "beginner": "Cơ bản",
    "intermediate": "Trung cấp",
    "advanced": "Nâng cao"
  },
  "dojos": {
    "title": "Danh bạ võ đường",
    "description": "Kết nối với các võ đường Iwama Aikido chính thống trên toàn thế giới. Mỗi võ đường đều cống hiến cho việc bảo tồn và truyền đạt những giáo huấn truyền thống của O-Sensei.",
    "searchPlaceholder": "Tìm kiếm theo tên, địa điểm hoặc huấn luyện viên...",
    "showing": "Hiển thị {count} võ đường",
    "showingPlural": "Hiển thị {count} võ đường",
    "phone": "Điện thoại",
    "email": "Email",
    "viewOnMap": "Xem trên bản đồ",
    "noDojosFound": "Không tìm thấy võ đường",
    "adjustSearch": "Hãy thử điều chỉnh tìm kiếm để xem thêm kết quả.",
    "clearSearch": "Xóa tìm kiếm",
    "beginYourJourney": "Bắt đầu hành trình của bạn",
    "journeyDescription": "Con đường Aikido bắt đầu bằng một bước chân đầu tiên. Liên hệ với võ đường gần bạn để quan sát một buổi tập hoặc bắt đầu luyện tập theo phong cách truyền thống Iwama.",
    "exploreTechniques": "Khám phá kỹ thuật"
  },
  "footer": {
    "description": "Bảo tồn và chia sẻ những giáo huấn truyền thống của phong cách Iwama Aikido thông qua nguyên lý Riai - sự thống nhất của cơ thể, kiếm và gậy.",
    "explore": "Khám phá",
    "home": "Trang chủ",
    "techniqueLibrary": "Thư viện kỹ thuật",
    "dojoDirectory": "Danh bạ võ đường",
    "philosophy": "Triết lý",
    "quote": "Budo chân chính là công việc của tình yêu. Đó là công việc trao sự sống cho tất cả chúng sinh, chứ không phải giết chóc hay đấu tranh với nhau.",
    "oSensei": "— Morihei Ueshiba, O-Sensei",
    "copyright": "© {year} Iwama Aikido Digital Library. Đã đăng ký bản quyền."
  },
  "notFound": {
    "title": "404",
    "pathNotFound": "Không tìm thấy đường",
    "description": "Như một học trò đã lạc lối, trang này không thể tìm thấy. Hãy để chúng tôi hướng dẫn bạn trở lại võ đường.",
    "returnHome": "Về trang chủ",
    "goBack": "Quay lại",
    "proverb": "Bảy lần ngã, tám lần đứng dậy."
  },
  "weapons": {
    "bokken": {
      "title": "木剣 Bokken",
      "subtitle": "Kiếm gỗ",
      "description": "Trong Iwama Aikido, kiếm gỗ (Bokken) là nền tảng để hiểu nguyên lý Riai. O-Sensei tin rằng mọi kỹ thuật tay không đều bắt nguồn từ kiếm. Tập luyện với Bokken giúp phát triển:",
      "points": [
        "Ma-ai (Khoảng cách) - Hiểu đúng tầm đánh",
        "Timing (Thời điểm) - Biết lúc nào cần hành động",
        "Tegatana (Lưỡi tay) - Sử dụng tay như kiếm",
        "Shisei (Tư thế) - Tư thế đúng từ đầu đến cuối"
      ]
    },
    "jo": {
      "title": "杖 Jo",
      "subtitle": "Gậy gỗ",
      "description": "Gậy Jo trong Iwama Aikido được O-Sensei phát triển từ nghệ thuật Sojutsu cổ. Jo có ưu thế độc đáo trong thực chiến vì có thể đánh từ cả hai đầu và linh hoạt trong không gian hẹp.",
      "points": [
        "Hai đầu tấn công - Linh hoạt hơn kiếm",
        "Khoảng cách an toàn - Giữ đối thủ ở xa",
        "31 Jo Kata - Kata nền tảng do O-Sensei sáng tạo",
        "Awase (Kết hợp) - Hòa nhập với năng lượng đối thủ"
      ]
    }
  },
  "common": {
    "loading": "Đang tải..."
  },
  "techniqueDetail": {
    "techniques": "Kỹ thuật",
    "step": "Bước {number}",
    "form": "Tư thế",
    "postures": "Tư thế",
    "notes": "Ghi chú",
    "features": "Đặc điểm",
    "keyPostures": "Các tư thế chính",
    "keyPosturesDesc": "Nắm vững các tư thế cơ bản này để phát triển kỹ thuật và sự hiểu biết đúng đắn",
    "importantNotes": "Ghi chú quan trọng",
    "importantNotesDesc": "Những hiểu biết thiết yếu từ các bậc thầy để đào sâu việc luyện tập",
    "characteristics": "Đặc điểm",
    "characteristicsDesc": "Những phẩm chất độc đáo xác định kỹ thuật này",
    "relatedTechniques": "Kỹ thuật liên quan",
    "backToLibrary": "Quay lại thư viện",
    "scroll": "Cuộn"
  },
  "techniqueData": {
    "categories": {
      "warmup": "Khởi động",
      "osaeWaza": "Kỹ thuật Khóa",
      "nageWaza": "Kỹ thuật Ném",
      "bukiDori": "Đoạt vũ khí"
    },
    "tai-no-henko": {
      "name": "Xoay người đổi hướng",
      "description": "Kỹ thuật xoay người - bắt buộc khởi động trong mọi lớp học Iwama để rèn luyện sự hòa hợp (ki) và hông (koshi).",
      "variants": ["Kihon (Cứng, nắm chặt)", "Ki no Nagare (Dòng chảy, mềm)"],
      "postures": {
        "kamae": {
          "title": "Kamae",
          "description": "Đứng ở tư thế hanmi, đối diện đối thủ. Giữ trọng tâm thấp và ổn định."
        },
        "receive": {
          "title": "Nhận nắm tay",
          "description": "Đối thủ nắm cổ tay bạn. Trong Kihon, họ nắm chặt cứng."
        },
        "tenkan": {
          "title": "Tenkan",
          "description": "Xoay người 180 độ, chân sau bước vòng cung phía sau, dẫn đối thủ theo hướng xoay."
        }
      },
      "notes": [
        "Giữ trọng tâm thấp trong suốt quá trình xoay.",
        "Không dùng sức tay, mà dùng hông để dẫn.",
        "Ki no Nagare thực hiện khi đối thủ vừa chạm tay, không đợi nắm chặt."
      ]
    },
    "morotedori-kokyuho": {
      "name": "Hô hấp pháp khi bị nắm hai tay",
      "description": "Phương pháp hô hấp khi bị nắm 2 tay vào 1 tay - bài tập ném đối thủ bằng lực hông và hơi thở.",
      "postures": {
        "grabbed": {
          "title": "Bị nắm",
          "description": "Đối thủ dùng hai tay nắm chặt một cổ tay của bạn."
        },
        "extend": {
          "title": "Mở rộng",
          "description": "Dùng lực từ hông và hara (bụng dưới), mở rộng cánh tay theo hướng lên trên hoặc ra ngoài."
        },
        "throw": {
          "title": "Ném",
          "description": "Tiếp tục mở rộng để phá vỡ thăng bằng đối thủ và ném họ xuống."
        }
      },
      "notes": [
        "Phối hợp hơi thở: hít vào khi chuẩn bị, thở ra khi mở rộng.",
        "Không dùng sức vai, sức phải đến từ hông."
      ]
    },
    "ikkyo": {
      "name": "Khóa số 1 (Đè cùi chỏ)",
      "description": "Khóa số 1 (Ude Osae) - Kỹ thuật đè cùi chỏ, là nền tảng cơ bản nhất trong Aikido. Dạy nguyên lý kiểm soát trung tâm đối thủ thông qua điều khiển cánh tay.",
      "postures": {
        "kamae": {
          "title": "Ai-hanmi Kamae",
          "description": "Bắt đầu ở tư thế cùng chiều với đối thủ. Giữ khoảng cách phù hợp (ma-ai)."
        },
        "entry": {
          "title": "Irimi Entry",
          "description": "Khi đối thủ tấn công, hòa nhập bằng cách đi sâu bên cạnh cánh tay họ. Tay trước nắm khuỷu tay, tay sau hướng dẫn cổ tay."
        },
        "pin": {
          "title": "Osae (Khóa)",
          "description": "Dẫn đối thủ xuống thảm theo chuyển động xoắn ốc. Cuối cùng đối thủ nằm úp, cánh tay duỗi thẳng, khuỷu tay và vai bị khóa."
        }
      },
      "notes": [
        "Không bao giờ dùng lực chống lực. Ikkyo hoạt động nhờ thời điểm và góc độ đúng.",
        "Giữ trung tâm của bạn kết nối với trung tâm đối thủ trong suốt kỹ thuật.",
        "Chuyển động cắt phải bắt nguồn từ hông, không phải từ tay (tegatana)."
      ]
    },
    "nikyo": {
      "name": "Khóa số 2 (Xoắn cổ tay)",
      "description": "Khóa số 2 (Kote Mawashi) - Xoắn cổ tay vào trong. Phát triển sự nhạy cảm với áp lực và góc độ trong khi duy trì kết nối.",
      "postures": {
        "grip": {
          "title": "Nắm cổ tay",
          "description": "Sau khi hòa nhập với tấn công, nắm cổ tay đối thủ theo kiểu C-grip. Ngón cái ở mu bàn tay, các ngón quấn quanh cổ tay."
        },
        "rotate": {
          "title": "Xoay cổ tay",
          "description": "Xoay cổ tay đối thủ vào trong trong khi kiểm soát khuỷu tay. Chuyển động xoay phải mượt mà và liên tục."
        },
        "pin": {
          "title": "Khóa quỳ",
          "description": "Đưa đối thủ xuống bằng khóa cổ tay, chuyển sang tư thế quỳ. Khóa cuối cùng giữ cả cổ tay và khuỷu tay."
        }
      },
      "notes": [
        "Hiệu quả của Nikyo đến từ góc độ chính xác, không phải lực nghiền. Tìm đúng góc và kỹ thuật không cần nhiều sức.",
        "Luôn kiểm soát khuỷu tay đối thủ. Không có kiểm soát khuỷu tay, đối thủ có thể thoát khóa cổ tay."
      ]
    },
    "sankyo": {
      "name": "Khóa số 3 (Xoắn ốc)",
      "description": "Khóa số 3 (Kote Hineri) - Xoắn cổ tay lên trên theo hình xoắn ốc qua toàn bộ cánh tay đến vai. Thể hiện bản chất xoắn ốc của chuyển động Aikido.",
      "postures": {
        "capture": {
          "title": "Bắt tay",
          "description": "Bắt tay đối thủ bằng cả hai tay, tạo cấu trúc với các ngón tay quấn trên bàn tay họ và ngón cái ấn vào lòng bàn tay."
        },
        "spiral": {
          "title": "Xoắn ốc",
          "description": "Xoay tay đối thủ theo chuyển động xoắn ốc về phía đường trung tâm của họ. Khuỷu tay sẽ nâng lên khi xoay tiếp tục."
        },
        "control": {
          "title": "Kiểm soát đứng",
          "description": "Duy trì khóa trong khi chuyển đến các vị trí khác nhau. Sankyo có thể dẫn đến ném hoặc khóa tùy tình huống."
        }
      },
      "notes": [
        "Xoắn ốc phải liên tục và kết nối với chuyển động trung tâm của bạn.",
        "Cẩn thận không xoay quá mức gây chấn thương cổ tay. Áp dụng khóa mượt mà và cho đối thủ thời gian tap."
      ]
    },
    "yonkyo": {
      "name": "Khóa số 4 (Bấm huyệt)",
      "description": "Khóa số 4 (Tekubi Osae) - Bấm huyệt cổ tay. Sử dụng áp lực lên dây thần kinh ở mặt trong cẳng tay để kiểm soát đối thủ.",
      "postures": {
        "grip": {
          "title": "Nắm cẳng tay",
          "description": "Nắm cẳng tay đối thủ với đốt ngón tay trỏ ấn vào điểm huyệt trên mặt trong cẳng tay."
        },
        "pressure": {
          "title": "Áp lực điểm huyệt",
          "description": "Áp dụng áp lực bằng đốt ngón tay trong khi giữ kiểm soát kiểu Ikkyo trên cánh tay."
        },
        "lead": {
          "title": "Dẫn xuống",
          "description": "Dùng áp lực điểm huyệt kết hợp với kiểm soát cánh tay để dẫn đối thủ xuống thảm."
        }
      },
      "notes": [
        "Điểm huyệt nằm cách cổ tay khoảng 1-2 tấc trên mặt trong cẳng tay.",
        "Yonkyo cần luyện tập nhiều để tìm đúng vị trí. Không phải ai cũng nhạy cảm với điểm này."
      ]
    },
    "gokyo": {
      "name": "Khóa số 5 (Tước dao)",
      "description": "Khóa số 5 (Ude Nobashi) - Tương tự Ikkyo nhưng tay cầm ngược để tước dao. Đặc biệt dùng cho kỹ thuật tanto-dori (tước dao).",
      "postures": {
        "defense": {
          "title": "Đối phó tấn công dao",
          "description": "Khi đối thủ tấn công bằng dao, hòa nhập và nắm cổ tay họ với ngón cái hướng xuống (ngược với Ikkyo)."
        },
        "control": {
          "title": "Kiểm soát khuỷu tay",
          "description": "Giữ khuỷu tay đối thủ duỗi thẳng và khóa, ngăn họ có thể cắt bạn."
        },
        "disarm": {
          "title": "Tước và khóa",
          "description": "Dẫn đối thủ xuống trong khi tước dao khỏi tay họ."
        }
      },
      "notes": [
        "Cách nắm ngược trong Gokyo giữ lưỡi dao hướng ra xa khỏi bạn.",
        "Luôn giữ khuỷu tay đối thủ duỗi thẳng để họ không thể cắt được."
      ]
    },
    "rokkyo": {
      "name": "Khóa số 6 (Khóa khuỷu tay)",
      "description": "Khóa số 6 (Hiji Kime Osae) - Khóa khớp khuỷu tay. Kỹ thuật khóa nâng cao tập trung vào việc cố định khuỷu tay.",
      "postures": {
        "grip": {
          "title": "Nắm cánh tay",
          "description": "Nắm cánh tay đối thủ với một tay trên cổ tay, tay kia trên khuỷu tay."
        },
        "lock": {
          "title": "Khóa khuỷu tay",
          "description": "Ép khuỷu tay đối thủ đưa lên cao trong khi giữ cổ tay thấp, tạo áp lực lên khớp khuỷu tay."
        },
        "complete": {
          "title": "Hoàn thành khóa",
          "description": "Dẫn đối thủ xuống thảm với khuỷu tay bị khóa."
        }
      },
      "notes": [
        "Cẩn thận khi áp dụng vì kỹ thuật này có thể gây chấn thương khuỷu tay nếu dùng quá mạnh.",
        "Rokkyo ít phổ biến hơn các khóa khác nhưng rất hiệu quả trong một số tình huống."
      ]
    },
    "shihonage": {
      "name": "Ném 4 phương",
      "description": "Ném 4 phương - Đặc sản Iwama: giữ tay chặt như cầm kiếm trước ngực. Kỹ thuật ném có thể đưa đối thủ theo bất kỳ hướng nào trong 4 hướng chính.",
      "postures": {
        "grasp": {
          "title": "Katate-dori Grasp",
          "description": "Từ nắm tay cùng phía, hòa nhập với năng lượng đối thủ trong khi nắm chặt cổ tay họ bằng cả hai tay."
        },
        "pivot": {
          "title": "Tenkan Pivot",
          "description": "Thực hiện xoay 180 độ trong khi nâng cánh tay đối thủ qua đầu. Chuyển động của bạn phải ở dưới cánh tay đối thủ."
        },
        "throw": {
          "title": "Hoàn thành ném",
          "description": "Hoàn thành ném bằng cách cắt xuống với cánh tay đối thủ trong khi bước qua. Đối thủ ngã ngửa ra sau."
        }
      },
      "notes": [
        "Đặc biệt trong Iwama: giữ tay như đang cầm kiếm trước ngực.",
        "Xoay phải đưa bạn hoàn toàn dưới cánh tay đối thủ. Xoay một phần dẫn đến kỹ thuật yếu hoặc nguy hiểm.",
        "Ném đến từ xoay hông, không phải từ kéo cánh tay."
      ]
    },
    "iriminage": {
      "name": "Ném nhập nội",
      "description": "Ném nhập nội - Đi vào 'điểm chết' sau gáy đối thủ. Kỹ thuật thể hiện nguyên lý irimi - di chuyển trực tiếp vào và xuyên qua tấn công.",
      "postures": {
        "entry": {
          "title": "Nhập nội ban đầu",
          "description": "Đi sâu qua tấn công của đối thủ, đặt mình bên cạnh họ với hông kết nối với trung tâm của họ."
        },
        "spiral": {
          "title": "Vẽ xoắn ốc",
          "description": "Kéo thăng bằng đối thủ theo chuyển động tròn, hạ thấp trung tâm của họ trong khi duy trì kết nối qua cánh tay và thân."
        },
        "throw": {
          "title": "Ném cuối cùng",
          "description": "Hoàn thành ném bằng cách nhập nội lần nữa trong khi cánh tay bạn dẫn đầu và cổ đối thủ ra sau."
        }
      },
      "notes": [
        "Irimi thực sự đòi hỏi cam kết hoàn toàn. Nhập nội nửa vời để bạn dễ bị phản công.",
        "Ném phải cảm thấy như một con sóng - đối thủ bị kéo vào, sau đó bị đẩy ra."
      ]
    },
    "kotegaeshi": {
      "name": "Ném lật cổ tay",
      "description": "Ném lật cổ tay - Kỹ thuật ném bằng cách lật ngược cổ tay đối thủ, tạo áp lực lên khớp cổ tay và phá vỡ thăng bằng.",
      "postures": {
        "grip": {
          "title": "Nắm cổ tay",
          "description": "Nắm cổ tay đối thủ với một tay trên mu bàn tay, tay kia hỗ trợ từ bên dưới."
        },
        "turn": {
          "title": "Lật cổ tay",
          "description": "Lật cổ tay đối thủ ra ngoài và xuống dưới, hướng về phía họ."
        },
        "throw": {
          "title": "Ném",
          "description": "Tiếp tục chuyển động lật để ném đối thủ xuống. Họ sẽ phải lộn ngược để tránh chấn thương cổ tay."
        }
      },
      "notes": [
        "Lật cổ tay phải kết hợp với tenkan để tạo động lượng.",
        "Không chỉ dùng tay, mà dùng cả cơ thể để tạo lực lật."
      ]
    },
    "kaitennage": {
      "name": "Ném vòng cầu",
      "description": "Ném vòng cầu - Có 2 loại: Uchi (luồn trong nách) và Soto (đè ngoài cổ). Kỹ thuật ném xoay vòng đặc trưng.",
      "variants": [
        "Uchi Kaiten-nage (luồn trong nách)",
        "Soto Kaiten-nage (đè ngoài cổ)"
      ],
      "postures": {
        "lead": {
          "title": "Nắm và dẫn",
          "description": "Nắm cánh tay đối thủ và dẫn họ theo vòng cung."
        },
        "rotate": {
          "title": "Xoay vòng",
          "description": "Uchi: Luồn dưới nách đối thủ. Soto: Ép từ bên ngoài cổ."
        },
        "throw": {
          "title": "Hoàn thành ném",
          "description": "Tiếp tục chuyển động xoay để ném đối thủ xuống theo vòng cung."
        }
      },
      "notes": [
        "Phân biệt rõ Uchi và Soto để áp dụng đúng tình huống.",
        "Giữ đối thủ mất thăng bằng trong suốt chuyển động xoay."
      ]
    },
    "tenchinage": {
      "name": "Ném trời đất",
      "description": "Ném trời đất - Kỹ thuật ném bằng cách tách hai tay đối thủ theo hai hướng ngược nhau: trời (lên) và đất (xuống).",
      "postures": {
        "ryotedori": {
          "title": "Ryote-dori",
          "description": "Đối thủ nắm cả hai cổ tay của bạn."
        },
        "separate": {
          "title": "Tách trời đất",
          "description": "Một tay vươn lên trời (ten), tay kia hướng xuống đất (chi), tạo ra lực tách đối thủ."
        },
        "throw": {
          "title": "Nhập nội và ném",
          "description": "Bước vào sâu trong khi duy trì sự tách, phá vỡ thăng bằng và ném đối thủ."
        }
      },
      "notes": [
        "Hai tay phải di chuyển đồng thời và quyết đoán.",
        "Bước irimi phải cùng lúc với việc tách tay."
      ]
    },
    "koshinage": {
      "name": "Ném hông",
      "description": "Ném hông - Iwama có rất nhiều biến thể Koshi-nage. Kỹ thuật ném sử dụng hông làm điểm tựa chính.",
      "postures": {
        "entry": {
          "title": "Nhập nội sâu",
          "description": "Đi sâu vào bên cạnh hoặc trước đối thủ, đặt hông của bạn thấp hơn trọng tâm của họ."
        },
        "lift": {
          "title": "Nâng lên hông",
          "description": "Sử dụng hông như điểm tựa, nâng đối thủ lên."
        },
        "throw": {
          "title": "Ném qua hông",
          "description": "Xoay và hạ thấp để ném đối thủ qua hông của bạn."
        }
      },
      "notes": [
        "Iwama có nhiều biến thể Koshi-nage khác nhau tùy theo cách tấn công.",
        "Hông phải thấp hơn trọng tâm đối thủ để ném hiệu quả.",
        "Cần luyện tập ukemi (lộn) tốt trước khi tập kỹ thuật này."
      ]
    },
    "jujinage": {
      "name": "Ném thập tự",
      "description": "Ném thập tự (Juji Garami) - Khóa tréo 2 tay của đối thủ thành hình chữ thập rồi ném.",
      "postures": {
        "grip": {
          "title": "Nắm hai tay",
          "description": "Từ ryote-dori hoặc tình huống tương tự, kiểm soát cả hai cổ tay đối thủ."
        },
        "cross": {
          "title": "Tréo tay",
          "description": "Dẫn hai tay đối thủ tréo nhau thành hình chữ thập (十)."
        },
        "throw": {
          "title": "Ném",
          "description": "Sử dụng cấu trúc tréo để phá vỡ thăng bằng và ném đối thủ."
        }
      },
      "notes": [
        "Giữ hai tay đối thủ tréo chặt để họ không thể thoát.",
        "Ném phải đến từ chuyển động cơ thể, không phải lực tay."
      ]
    },
    "kokyunage": {
      "name": "Ném hô hấp",
      "description": "Ném bằng lực hô hấp - Đây là nhóm đòn rộng nhất, không có khuôn mẫu cố định, tùy biến hóa. Ném bằng kokyu-ryoku (sức mạnh hô hấp).",
      "postures": {
        "receive": {
          "title": "Tiếp nhận tấn công",
          "description": "Hòa nhập với bất kỳ loại tấn công nào từ đối thủ."
        },
        "guide": {
          "title": "Hướng dẫn năng lượng",
          "description": "Sử dụng kokyu (hô hấp/năng lượng) để dẫn năng lượng đối thủ."
        },
        "throw": {
          "title": "Ném tự nhiên",
          "description": "Ném đối thủ theo hướng năng lượng của họ đang đi, không cần kỹ thuật khóa cố định."
        }
      },
      "notes": [
        "Kokyu-nage là nhóm kỹ thuật rộng nhất, bao gồm mọi ném không thuộc các loại khác.",
        "Không có khuôn mẫu cố định - đòi hỏi sự nhạy cảm và linh hoạt cao.",
        "Thể hiện sự thành thạo cao khi có thể ném mượt mà mà không cần dùng lực."
      ]
    },
    "kokyu-ho": {
      "name": "Bài tập hô hấp",
      "description": "Bài tập sức mạnh hô hấp ngồi. Thường thực hiện cuối mỗi buổi tập để rèn luyện kokyu-ryoku.",
      "postures": {
        "seiza": {
          "title": "Seiza",
          "description": "Cả hai ngồi seiza đối diện nhau. Đối thủ nắm chặt cả hai cổ tay của bạn."
        },
        "extend": {
          "title": "Mở rộng",
          "description": "Mở rộng cánh tay về phía trước và lên trên trong khi giữ vai thả lỏng. Sức mạnh đến từ hara (bụng dưới)."
        },
        "project": {
          "title": "Đẩy ngã",
          "description": "Tiếp tục mở rộng để phá vỡ thăng bằng đối thủ và đẩy họ ngã về phía sau."
        }
      },
      "notes": [
        "Thả lỏng vai hoàn toàn. Căng thẳng ngăn dòng chảy sức mạnh từ trung tâm.",
        "Thở tự nhiên trong suốt quá trình. Nín thở tạo ra cứng nhắc và yếu đuối."
      ]
    },
    "suburi-ichi": {
      "name": "Vung kiếm số 1",
      "description": "Vung kiếm đầu tiên và cơ bản nhất trong Aiki-ken. Bài tập này phát triển hình thức cắt đúng, phối hợp hơi thở, và chuyển động trung tâm.",
      "postures": {
        "chudan": {
          "title": "Chudan Kamae",
          "description": "Bắt đầu ở tư thế trung đẳng với mũi kiếm ở độ cao cổ họng. Nắm tay thả lỏng nhưng chắc chắn."
        },
        "raise": {
          "title": "Nâng (Furikaburi)",
          "description": "Nâng kiếm lên trên đầu theo vòng cung lớn. Mũi kiếm đi qua đường trung tâm của bạn."
        },
        "cut": {
          "title": "Cắt (Kirioroshi)",
          "description": "Thực hiện cắt xuống bằng cách hạ trung tâm và để trọng lực hỗ trợ. Dừng với mũi kiếm ở độ cao đầu gối."
        }
      },
      "notes": [
        "Cắt phải đến từ trung tâm, không phải từ tay. Cơ thể bạn hạ xuống, kiếm theo sau.",
        "Phối hợp hơi thở: hít vào khi nâng, thở ra khi cắt."
      ]
    },
    "kumitachi-ichi": {
      "name": "Kiếm đôi số 1",
      "description": "Kata kiếm đôi đầu tiên trong Iwama Aiki-ken. Bài tập này phát triển thời điểm, khoảng cách, và khả năng đọc ý định đối thủ.",
      "postures": {
        "opening": {
          "title": "Vị trí mở đầu",
          "description": "Cả hai đối tác bắt đầu ở chudan kamae với khoảng cách phù hợp (issoku itto no ma)."
        },
        "attack": {
          "title": "Tấn công và phản ứng",
          "description": "Uchitachi khởi đầu với shomen cut. Uketachi đón nhận bằng cách nâng kiếm và hòa nhập với năng lượng đến."
        },
        "counter": {
          "title": "Phản công và kết thúc",
          "description": "Uketachi hoàn thành kata với đòn phản công quyết đoán trong khi uchitachi chấp nhận kỹ thuật."
        }
      },
      "notes": [
        "Vai trò của uchitachi là cung cấp tấn công chân thành để phát triển khả năng của uketachi.",
        "Kata nên chảy tự nhiên khi đã học. Do dự hoặc vội vàng đều cho thấy cần cải thiện."
      ]
    },
    "jo-suburi-ichi": {
      "name": "Vung gậy số 1",
      "description": "Bài tập vung gậy đầu tiên. Luyện tập Jo trong phong cách Iwama phát triển chuyển động tròn, phối hợp hai tay, và dòng chảy năng lượng.",
      "postures": {
        "kamae": {
          "title": "Choku-tsuki Kamae",
          "description": "Giữ jo với cả hai tay, tay sau gần cuối, tay trước khoảng 1/3 từ đầu. Jo chỉ vào cổ họng đối thủ."
        },
        "prepare": {
          "title": "Chuẩn bị đâm",
          "description": "Kéo jo về phía sau theo đường trung tâm trong khi chuyển trọng lượng về chân sau. Jo giữ ngang."
        },
        "thrust": {
          "title": "Thực hiện đâm",
          "description": "Đẩy về phía trước với chân sau trong khi duỗi jo thành đường đâm thẳng. Sức mạnh đến từ hông."
        }
      },
      "notes": [
        "Đâm và bước chân phải thống nhất. Đến trước hoặc sau vũ khí đều tạo ra lỗ hổng.",
        "Nhận thức toàn bộ chiều dài jo. Đầu sau cũng là một vũ khí."
      ]
    },
    "thirty-one-jo-kata": {
      "name": "Kata 31 gậy",
      "description": "Kata jo nền tảng của Iwama Aikido, gồm 31 động tác. Kata này thể hiện nguyên lý Riai - sự tích hợp của jo, ken, và taijutsu.",
      "postures": {
        "opening": {
          "title": "Chuỗi mở đầu",
          "description": "Kata bắt đầu với choku-tsuki tiếp theo là một loạt đòn đánh và đâm thiết lập nhịp điệu."
        },
        "middle": {
          "title": "Phần giữa",
          "description": "Phần giữa bao gồm các tổ hợp phức tạp hơn bao gồm kaeshi-tsuki (đâm quay lại) và các mẫu đánh khác nhau."
        },
        "closing": {
          "title": "Chuỗi kết thúc",
          "description": "Kata kết thúc với các động tác quyết đoán thể hiện tất cả các nguyên lý đã luyện tập, kết thúc với zanshin phù hợp."
        }
      },
      "notes": [
        "Học từng động tác riêng lẻ trước khi cố gắng chảy qua toàn bộ kata. Chất lượng hơn tốc độ.",
        "Mỗi động tác trong kata đều có ứng dụng võ thuật. Luyện tập với nhận thức về đối thủ tưởng tượng.",
        "31 Jo Kata nên được luyện tập cả đơn và với 31 Kumijo (luyện tập đôi) để hiểu đầy đủ các ứng dụng."
      ]
    },
    "tachi-dori": {
      "name": "Tay không đoạt kiếm",
      "description": "Tay không đoạt kiếm - Kỹ thuật sử dụng taijutsu để tước kiếm từ đối thủ có vũ trang.",
      "postures": {
        "face": {
          "title": "Đối mặt kiếm",
          "description": "Đối thủ tấn công bằng kiếm. Bạn di chuyển để tránh đòn cắt."
        },
        "control": {
          "title": "Nhập nội và kiểm soát",
          "description": "Đi vào khoảng cách nguy hiểm và kiểm soát cánh tay cầm kiếm của đối thủ."
        },
        "disarm": {
          "title": "Tước kiếm",
          "description": "Áp dụng kỹ thuật khóa hoặc ném đồng thời tước kiếm khỏi tay đối thủ."
        }
      },
      "notes": [
        "Thời điểm và irimi là yếu tố sống còn khi đối mặt với vũ khí.",
        "Luyện tập với kiếm gỗ (bokken) để đảm bảo an toàn."
      ]
    },
    "jo-dori": {
      "name": "Tay không đoạt gậy",
      "description": "Tay không đoạt gậy - Kỹ thuật sử dụng taijutsu để tước gậy từ đối thủ có vũ trang.",
      "postures": {
        "face": {
          "title": "Đối mặt gậy",
          "description": "Đối thủ tấn công bằng jo. Bạn di chuyển để tránh đòn đánh hoặc đâm."
        },
        "entry": {
          "title": "Nhập nội",
          "description": "Đi vào bên trong tầm với của gậy và kiểm soát đối thủ."
        },
        "disarm": {
          "title": "Tước gậy",
          "description": "Áp dụng kỹ thuật để tước gậy hoặc ném đối thủ."
        }
      },
      "notes": [
        "Jo có tầm với dài, cần nhập nội quyết đoán.",
        "Cẩn thận cả hai đầu gậy đều là vũ khí."
      ]
    },
    "tanto-dori": {
      "name": "Tay không đoạt dao",
      "description": "Tay không đoạt dao - Kỹ thuật sử dụng taijutsu để tước dao từ đối thủ có vũ trang. Thường sử dụng Gokyo.",
      "postures": {
        "face": {
          "title": "Đối mặt dao",
          "description": "Đối thủ tấn công bằng dao. Đây là tình huống nguy hiểm nhất."
        },
        "evade": {
          "title": "Tránh và kiểm soát",
          "description": "Tránh đường đâm/cắt và ngay lập tức kiểm soát cánh tay cầm dao."
        },
        "disarm": {
          "title": "Tước dao (Gokyo)",
          "description": "Áp dụng Gokyo hoặc kỹ thuật tương tự với cách nắm ngược để tước dao an toàn."
        }
      },
      "notes": [
        "Trong Gokyo, cách nắm ngược giữ lưỡi dao hướng ra xa khỏi bạn.",
        "Luôn giữ khuỷu tay đối thủ duỗi thẳng để họ không thể cắt được.",
        "Tanto-dori đòi hỏi sự tập trung và chính xác cao nhất."
      ]
    },
    "jo-nage": {
      "name": "Dùng gậy ném",
      "description": "Dùng gậy để ném đối thủ - Kỹ thuật sử dụng jo như một công cụ để khóa và ném đối thủ tay không hoặc có vũ khí.",
      "postures": {
        "hold": {
          "title": "Cầm jo",
          "description": "Bạn đang cầm jo, đối thủ tấn công bạn (có thể tay không hoặc có vũ khí)."
        },
        "control": {
          "title": "Sử dụng jo để kiểm soát",
          "description": "Sử dụng jo để chặn, đánh, hoặc khóa đối thủ."
        },
        "throw": {
          "title": "Ném bằng jo",
          "description": "Sử dụng jo như đòn bẩy hoặc điểm kiểm soát để ném đối thủ."
        }
      },
      "notes": [
        "Jo-nage khác với Jo-dori - ở đây BẠN là người cầm gậy.",
        "Jo có thể được sử dụng theo nhiều cách: đánh, đâm, khóa, hoặc làm đòn bẩy."
      ]
    }
  }
}
